Revit 2026 API

# ConceptualConstructionShadeType Enumeration

---

ConceptualConstructionType values for Shades.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ConceptualConstructionShadeType
```
```vb
Public Enumeration ConceptualConstructionShadeType
```
```cpp
public enum class ConceptualConstructionShadeType
```
```fsharp
type ConceptualConstructionShadeType
```

| Member name | Value | Description |
| --- | --- | --- |
| BasicShade | 0 | Basic Shade |
| InvalidShadeTypeConstruction | -1 | Invalid value/not set Shade Type Construction |
| NumShadeTypeConstruction | 1 | Total Number of Shade Type Constructions |

#### Reference

Autodesk.Revit.DB.Analysis Namespace